import { TextValue } from "../interfaces/option";

/*
ระบบการจัดการ(MM)
อัคดีภัย (FR)
สารเคมีอันตราย (CH)
ไฟฟ้า (EL)
การฝึกอบรม / ซ้อมแผน (TR)
ความร้อน แสง เสียง (EN)
ที่อับอากาศ (CF)
ประดานำ ( DR)
การตรวจสุขภาพ ( HC)
นั่งร้านและคำยัน (SC)
งานก่อสร้าง ( CW)
การทำงานที่สูง (WH)
เครื่องจักร (MC)
ปั่นจั่น ( HC)
หม้อนำ ( BO)
รังสี ( RA)
เจ้าหน้าที่ความปลอดภัย (SA)
บริหารแรงงาน (LB)
เทคโนโลยี ( IT)
คุ้มครองข้อมูล (PD)
ข้อกำหนดลูกค้า (CU)
*/
export const legalCategoryOptions:TextValue[] = [
    {
        text: "ระบบการจัดการ (MM)",
        value: "MM"
    }
    ,
    {
        text: "อัคดีภัย (FR)",
        value: "FR"
    }
    ,
    {
        text: "สารเคมีอันตราย (CH)",
        value: "CH"
    }
    ,
    {
        text: "ไฟฟ้า (EL)",
        value: "EL"
    }
    ,
    {
        text: "การฝึกอบรม / ซ้อมแผน (TR)",
        value: "TR"
    }
    ,
    {
        text: "ความร้อน แสง เสียง (EN)",
        value: "EN"
    }
    ,
    {
        text: "ที่อับอากาศ (CF)",
        value: "CF"
    }
    ,
    {
        text: "ประดานำ (DR)",
        value: "DR"
    }
    ,
    {
        text: "การตรวจสุขภาพ (HC)",
        value: "HC"
    }
    ,
    {
        text: "นั่งร้านและคำยัน (SC)",
        value: "SC"
    }
    ,
    {
        text: "งานก่อสร้าง (CW)",
        value: "CW"
    }
    ,
    {
        text: "การทำงานที่สูง (WH)",
        value: "WH"
    }
    ,
    {
        text: "เครื่องจักร (MC)",
        value: "MC"
    }
    ,
    {
        text: "ปั่นจั่น (HC)",
        value: "HC"
    }
    ,
    {
        text: "หม้อนำ (BO)",
        value: "BO"
    }
    ,
    {
        text: "รังสี (RA)",
        value: "RA"
    }
    ,
    {
        text: "เจ้าหน้าที่ความปลอดภัย (SA)",
        value: "SA"
    }
    ,
    {
        text: "บริหารแรงงาน (LB)",
        value: "LB"
    }
    ,
    {
        text: "เทคโนโลยี (IT)",
        value: "IT"
    }
    ,
    {
        text: "คุ้มครองข้อมูล (PD)",
        value: "PD"
    }
    ,
    {
        text: "ข้อกำหนดลูกค้า (CU)",
        value: "CU"
    }
]

/*
กระทรวงแรงงาน
กระทรวงอุดสาหกรรม
กระทรวงกลาโหม
กระทรวงพลังงาน
กระทรวงสาธารณสุข
กระทรวงทรัพยากรธรรมชาติและ
สิ่งแวดล้อม
กระทรวงวิทยาศาสตร์และเทค
โลโลยี
กระทรวงเทคโนโลยีสารสนเทศ
และการสื่อสาร
กระทรวงมหาดไทย
องค์การจัดการน้ำเสีย
ทำาเรือแห่งประเทศไทย
การนิคมอุดสาหกรรมแห่ง
ประเทศไทย
องค์การเภสัชกรรม
*/

export const ministryOptions: TextValue[] = [
    {
        text: "กระทรวงแรงงาน",
        value: "กระทรวงแรงงาน"
    }
    ,
    {
        text: "กระทรวงอุดสาหกรรม",
        value: "กระทรวงอุดสาหกรรม"
    }
    ,
    {
        text: "กระทรวงกลาโหม",
        value: "กระทรวงกลาโหม"
    }
    ,
    {
        text: "กระทรวงพลังงาน",
        value: "กระทรวงพลังงาน"
    }
    ,
    {
        text: "กระทรวงสาธารณสุข",
        value: "กระทรวงสาธารณสุข"
    }
    ,
    {
        text: "กระทรวงทรัพยากรธรรมชาติและ สิ่งแวดล้อม",
        value: "กระทรวงทรัพยากรธรรมชาติและ สิ่งแวดล้อม"
    }
    ,
    {
        text: "กระทรวงวิทยาศาสตร์และเทคโลโลยี",
        value: "กระทรวงวิทยาศาสตร์และเทคโลโลยี"
    }
    ,
    {
        text: "กระทรวงเทคโนโลยีสารสนเทศและการสื่อสาร",
        value: "กระทรวงเทคโนโลยีสารสนเทศและการสื่อสาร"
    }
    ,
    {
        text: "กระทรวงมหาดไทย",
        value: "กระทรวงมหาดไทย"
    }
    ,
    {
        text: "องค์การจัดการน้ำเสีย",
        value: "องค์การจัดการน้ำเสีย"
    }
    ,
    {
        text: "ท่าเรือแห่งประเทศไทย",
        value: "ท่าเรือแห่งประเทศไทย"
    }
    ,
    {
        text: "การนิคมอุดสาหกรรมแห่งประเทศไทย",
        value: "การนิคมอุดสาหกรรมแห่งประเทศไทย"
    }
    ,
    {
        text: "องค์การเภสัชกรรม",
        value: "องค์การเภสัชกรรม"
    }
]

/*
แจ้งเพื่อทราบ / แบบฟอร์ม
ให้ตำเนินการให้สอดคล้อง
ให้ดำาเนินการตามระยะเวลา
ยกเลิกฉบับเติม
*/
export const lawTypeOptions: TextValue[] = [
    {
        text: "แจ้งเพื่อทราบ / แบบฟอร์ม",
        value: "แจ้งเพื่อทราบ / แบบฟอร์ม"
    }
    ,
    {
        text: "ให้ตำเนินการให้สอดคล้อง",
        value: "ให้ตำเนินการให้สอดคล้อง"
    }
    ,
    {
        text: "ให้ดำาเนินการตามระยะเวลา",
        value: "ให้ดำาเนินการตามระยะเวลา"
    }
    ,
    {
        text: "ยกเลิกฉบับเติม",
        value: "ยกเลิกฉบับเติม"
    }
]

/*
ระบบการจัดการอาชีวอนามัยและความปลอดภัย (IS045001)
ระบบการจัดการสั่งแวตล้อม (ISO14001)
ระบบการจัดการคุณภาพ (ISO9001)
ะบบการบริหารจัดการความต่อเนื่องทางธุรกิจ (IS022301)
ระบบการบริหารจัดการความมันคงทางไขเบอร์ (ISO27001)
*/
export const managementSystemOptions: TextValue[] = [
    {
        text: "ระบบการจัดการอาชีวอนามัยและความปลอดภัย (IS045001)",
        value: "IS045001"
    }
    ,
    {
        text: "ระบบการจัดการสั่งแวตล้อม (ISO14001)",
        value: "ISO14001"
    }
    ,
    {
        text: "ระบบการจัดการคุณภาพ (ISO9001)",
        value: "ISO9001"
    }
    ,
    {
        text: "ระบบการบริหารจัดการความต่อเนื่องทางธุรกิจ (IS022301)",
        value: "IS022301"
    }
    ,
    {
        text: "ระบบการบริหารจัดการความมันคงทางไขเบอร์ (ISO27001)",
        value: "ISO27001"
    }
]

/*
นิคมอุตสาหกรรมอุดรธานี
นิคมอุตสาหกรรมไฮเทค กบินทร
นิคมอุตสาหกรรมบ่อทอง 33
นิคมอุตสาหกรรมสระแก้ว
นิคมอุตสาหกรรมเวลโกรว์
นิคมอุตสาหกรรมเกตเวย์ซิตี้
นิคมอุตสาหกรรมทีเอฟดี
นิคมอุตสาหกรรมทีเอฟดี 2
นิคมอุตสาหกรรมฉะเชิงเทรา บลูเทค ซิตี้
นิคมอุตสาหกรรมมาบตาพุด
นิคมอุตสาหกรรมดับบลิวเอชเอ ตะวันออก (มาบตาพุด)
นิคมอุตสาหกรรมผาแดง
นิคมอุตสาหกรรมอีสเทิร์นซีบอร์ด (ระยอง)
นิคมอุตสาหกรรมอมตะซิตี้ ระยอง
นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 1
นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 4
นิคมอุตสาหกรรมดับบลิวเอชเอ ระยอง 36
นิคมอุตสาหกรรมเอเชีย
นิคมอุตสาหกรรมอาร์ไอแอล
นิคมอุตสาหกรรมดับบลิวเอชเอ อินดัสเตรียล เอสเตท ระยอง
นิคมอุตสาหกรรมหลักชัยเมืองยาง
ท่าเรืออุตสาหกรรมมาบตาพุด
นิคมอุตสาหกรรมปิ่นทอง (โครงการ 6)
นิคมอุตสาหกรรมซีพีจีซี
นิคมอุตสาหกรรม Smart Park
นิคมอุตสาหกรรมเอ็กโก ระยอง 
นิคมอุตสาหกรรมดับบลิวเอชเอ ชลบุรี
นิคมอุตสาหกรรมดับบลิวเอชเอ ชลบุรี 2
นิคมอุตสาหกรรมอมตะซิตี้ ชลบุรี
นิคมอุตสาหกรรมอมตะซิตี้ ชลบุรี (โครงการ 2)
นิคมอุตสาหกรรมแหลมฉบัง
นิคมอุตสาหกรรมปิ่นทอง 
นิคมอุตสาหกรรมปิ่นนทอง (โครงการ 3)
นิคมอุตสาหกรรมปิ่นนทอง (โครงการ 4)
นิคมอุตสาหกรรมปิ่นนทอง (โครงการ 5)
นิคมอุตสาหกรรมปิ่นทอง (แหลมฉบัง)
นิคมอุตสาหกรรมบ้านบึง
นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 2
นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 3
นิคมอุตสาหกรรมยามาโตะ อินดัสทรีส
นิคมอุตสาหกรรมโรจนะแหลมฉบัง
นิคมอุตสาหกรรมโรจนะชลบุรี 2 (เขาคันทรง)
นิคมอุตสาหกรรมเอเชียคลีน ชลบุรี
นิคมอุตสาหกรรมโรจนะ หนองใหญ่
นิคมอุตสาหกรรมบางปู
นิคมอุตสาหกรรมบางปู (เหนือ)
นิคมอุตสาหกรรมบางพลี
นิคมอุตสาหกรรมเอเชีย (สุวรรณภูมิ)
นิคมอุตสาหกรรมแพรกษา อินดัสเทรียลล์
นิคมอุตสาหกรรมสงขลา
นิคมอุตสาหกรรมภาคใต้
นิคมอุตสาหกรรมอัญธานี
นิคมอุตสาหกรรมลาดกระบัง
นิคมอุตสาหกรรมบางชัน
นิคมอุตสาหกรรมราชบุรี
นิคมอุตสาหกรรมมหาราชนคร
นิคมอุตสาหกรรมสินสาคร
นิคมอุตสาหกรรมสมุทรสาคร
นิคมอุตสาหกรรมนครหลวง
นิคมอุตสาหกรรมบางปะอิน
นิคมอุตสาหกรรมบ้านหว้า
นิคมอุตสาหกรรมเวิลด์ ฟู้ด วัลเลย์ ไทยแลนด
นิคมอุตสาหกรรมหนองแค
นิคมอุตสาหกรรมแก่งคอย
นิคมอุตสาหกรรมพิจิตร
นิคมอุตสาหกรรมเวิลด์ (ลําพูน)
นิคมอุตสาหกรรมภาคเหนือ 
*/

export const settlementOptions: TextValue[] = [
    {
        text: "นิคมอุตสาหกรรมอุดรธานี",
        value: "นิคมอุตสาหกรรมอุดรธานี"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมไฮเทค กบินทร",
        value: "นิคมอุตสาหกรรมไฮเทค กบินทร"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมบ่อทอง 33",
        value: "นิคมอุตสาหกรรมบ่อทอง 33"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมสระแก้ว",
        value: "นิคมอุตสาหกรรมสระแก้ว"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมเวลโกรว์",
        value: "นิคมอุตสาหกรรมเวลโกรว์"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมเกตเวย์ซิตี้",
        value: "นิคมอุตสาหกรรมเกตเวย์ซิตี้"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมทีเอฟดี",
        value: "นิคมอุตสาหกรรมทีเอฟดี"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมทีเอฟดี 2",
        value: "นิคมอุตสาหกรรมทีเอฟดี 2"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมฉะเชิงเทรา บลูเทค ซิตี้",
        value: "นิคมอุตสาหกรรมฉะเชิงเทรา บลูเทค ซิตี้"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมมาบตาพุด",
        value: "นิคมอุตสาหกรรมมาบตาพุด"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมดับบลิวเอชเอ ตะวันออก (มาบตาพุด)",
        value: "นิคมอุตสาหกรรมดับบลิวเอชเอ ตะวันออก (มาบตาพุด)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมผาแดง",
        value: "นิคมอุตสาหกรรมผาแดง"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมอีสเทิร์นซีบอร์ด (ระยอง)",
        value: "นิคมอุตสาหกรรมอีสเทิร์นซีบอร์ด (ระยอง)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมอมตะซิตี้ ระยอง",
        value: "นิคมอุตสาหกรรมอมตะซิตี้ ระยอง"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 1",
        value: "นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 1"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 4",
        value: "นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 4"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมดับบลิวเอชเอ ระยอง 36",
        value: "นิคมอุตสาหกรรมดับบลิวเอชเอ ระยอง 36"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมเอเชีย",
        value: "นิคมอุตสาหกรรมเอเชีย"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมอาร์ไอแอล",
        value: "นิคมอุตสาหกรรมอาร์ไอแอล"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมดับบลิวเอชเอ อินดัสเตรียล เอสเตท ระยอง",
        value: "นิคมอุตสาหกรรมดับบลิวเอชเอ อินดัสเตรียล เอสเตท ระยอง"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมหลักชัยเมืองยาง",
        value: "นิคมอุตสาหกรรมหลักชัยเมืองยาง"
    }
    ,
    {
        text: "ท่าเรืออุตสาหกรรมมาบตาพุด",
        value: "ท่าเรืออุตสาหกรรมมาบตาพุด"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมปิ่นทอง (โครงการ 6)",
        value: "นิคมอุตสาหกรรมปิ่นทอง (โครงการ 6)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมซีพีจีซี",
        value: "นิคมอุตสาหกรรมซีพีจีซี"
    }
    ,
    {
        text: "นิคมอุตสาหกรรม Smart Park",
        value: "นิคมอุตสาหกรรม Smart Park"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมเอ็กโก ระยอง ",
        value: "นิคมอุตสาหกรรมเอ็กโก ระยอง "
    }
    ,
    {
        text: "นิคมอุตสาหกรรมดับบลิวเอชเอ ชลบุรี",
        value: "นิคมอุตสาหกรรมดับบลิวเอชเอ ชลบุรี"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมดับบลิวเอชเอ ชลบุรี 2",
        value: "นิคมอุตสาหกรรมดับบลิวเอชเอ ชลบุรี 2"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมอมตะซิตี้ ชลบุรี",
        value: "นิคมอุตสาหกรรมอมตะซิตี้ ชลบุรี"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมอมตะซิตี้ ชลบุรี (โครงการ 2)",
        value: "นิคมอุตสาหกรรมอมตะซิตี้ ชลบุรี (โครงการ 2)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมแหลมฉบัง",
        value: "นิคมอุตสาหกรรมแหลมฉบัง"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมปิ่นทอง ",
        value: "นิคมอุตสาหกรรมปิ่นทอง "
    }
    ,
    {
        text: "นิคมอุตสาหกรรมปิ่นทอง (โครงการ 3)",
        value: "นิคมอุตสาหกรรมปิ่นทอง (โครงการ 3)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมปิ่นทอง (โครงการ 4)",
        value: "นิคมอุตสาหกรรมปิ่นทอง (โครงการ 4)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมปิ่นทอง (โครงการ 5)",
        value: "นิคมอุตสาหกรรมปิ่นทอง (โครงการ 5)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมปิ่นทอง (แหลมฉบัง)",
        value: "นิคมอุตสาหกรรมปิ่นทอง (แหลมฉบัง)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมบ้านบึง",
        value: "นิคมอุตสาหกรรมบ้านบึง"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 2",
        value: "นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 2"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 3",
        value: "นิคมอุตสาหกรรมดับบลิวเอชเอ อีสเทิร์นซีบอร์ด 3"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมยามาโตะ อินดัสทรีส",
        value: "นิคมอุตสาหกรรมยามาโตะ อินดัสทรีส"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมโรจนะแหลมฉบัง",
        value: "นิคมอุตสาหกรรมโรจนะแหลมฉบัง"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมเอเชียคลีน ชลบุรี",
        value: "นิคมอุตสาหกรรมเอเชียคลีน ชลบุรี"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมโรจนะ หนองใหญ่",
        value: "นิคมอุตสาหกรรมโรจนะ หนองใหญ่"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมบางปู",
        value: "นิคมอุตสาหกรรมบางปู"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมบางปู (เหนือ)",
        value: "นิคมอุตสาหกรรมบางปู (เหนือ)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมบางพลี",
        value: "นิคมอุตสาหกรรมบางพลี"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมเอเชีย (สุวรรณภูมิ)",
        value: "นิคมอุตสาหกรรมเอเชีย (สุวรรณภูมิ)"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมแพรกษา อินดัสเทรียลล์",
        value: "นิคมอุตสาหกรรมแพรกษา อินดัสเทรียลล์"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมสงขลา",
        value: "นิคมอุตสาหกรรมสงขลา"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมภาคใต้",
        value: "นิคมอุตสาหกรรมภาคใต้"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมอัญธานี",
        value: "นิคมอุตสาหกรรมอัญธานี"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมลาดกระบัง",
        value: "นิคมอุตสาหกรรมลาดกระบัง"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมบางชัน",
        value: "นิคมอุตสาหกรรมบางชัน"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมราชบุรี",
        value: "นิคมอุตสาหกรรมราชบุรี"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมมหาราชนคร",
        value: "นิคมอุตสาหกรรมมหาราชนคร"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมสินสาคร",
        value: "นิคมอุตสาหกรรมสินสาคร"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมสมุทรสาคร",
        value: "นิคมอุตสาหกรรมสมุทรสาคร"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมนครหลวง",
        value: "นิคมอุตสาหกรรมนครหลวง"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมบางปะอิน",
        value: "นิคมอุตสาหกรรมบางปะอิน"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมบ้านหว้า",
        value: "นิคมอุตสาหกรรมบ้านหว้า"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมเวิลด์ ฟู้ด วัลเลย์ ไทยแลนด",
        value: "นิคมอุตสาหกรรมเวิลด์ ฟู้ด วัลเลย์ ไทยแลนด"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมหนองแค",
        value: "นิคมอุตสาหกรรมหนองแค"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมแก่งคอย",
        value: "นิคมอุตสาหกรรมแก่งคอย"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมพิจิตร",
        value: "นิคมอุตสาหกรรมพิจิตร"
    }
    ,
    {
        text: "นิคมอุตสาหกรรมเวิลด์ (ลําพูน)",
        value: "นิคมอุตสาหกรรมเวิลด์ (ลําพูน)"
    },
    {
        text: "นิคมอุตสาหกรรมภาคเหนือ",
        value: "นิคมอุตสาหกรรมภาคเหนือ"
    }
]
/*
    อุตสาหกรรมเกี่ยวกับการทำเหมืองตามกฎหมายว่าด้วยแร่
    อุตสาหกรรมเกี่ยวกับกิจการปิโตรเลียมตามกฎหมายว่าด้วยปิโตรเลียม
    อุตสาหกรรมเกี่ยวกับปิโตรเคมี
    อุตสาหกรรมเกี่ยวกับการกลั่นน้ำมันปิโตรเลียม
    อุตสาหกรรมเกี่ยวกับการแยกก๊าซธรรมชาติ
*/

 const account1Options: TextValue[] = [
    {
        text: "อุตสาหกรรมเกี่ยวกับการทำเหมืองตามกฎหมายว่าด้วยแร่",
        value: "อุตสาหกรรมเกี่ยวกับการทำเหมืองตามกฎหมายว่าด้วยแร่"
    }
    ,
    {
        text: "อุตสาหกรรมเกี่ยวกับกิจการปิโตรเลียมตามกฎหมายว่าด้วยปิโตรเลียม",
        value: "อุตสาหกรรมเกี่ยวกับกิจการปิโตรเลียมตามกฎหมายว่าด้วยปิโตรเลียม"
    }
    ,
    {
        text: "อุตสาหกรรมเกี่ยวกับปิโตรเคมี",
        value: "อุตสาหกรรมเกี่ยวกับปิโตรเคมี"
    }
    ,
    {
        text: "อุตสาหกรรมเกี่ยวกับการกลั่นน้ำมันปิโตรเลียม",
        value: "อุตสาหกรรมเกี่ยวกับการกลั่นน้ำมันปิโตรเลียม"
    }
    ,
    {
        text: "อุตสาหกรรมเกี่ยวกับการแยกก๊าซธรรมชาติ",
        value: "อุตสาหกรรมเกี่ยวกับการแยกก๊าซธรรมชาติ"
    }
]
/*
อุตสาหกรรมสิ่งพิมพ์
อุตสาหกรรมผลิตภัณฑ์อาหาร
อุตสาหกรรมเครื่องดื่ม
อุตสาหกรรมผลิตภัณฑ์จากยาสูบ
อุตสาหกรรมสิ่งทอ
อุตสาหกรรมเสื้อผ้าหรือเครื่องแต่งกาย
อุตสาหกรรมเครื่องหนัง
อุตสาหกรรมผลิตภัณฑ์จากไม้
อุตสาหกรรมกระดาษหรือผลิตภัณฑ์ที่แปรรูปจากกระดาษ
อุตสาหกรรมการผลิตสารเคมีหรือเคมีภัณฑ์
อุตสาหกรรมเภสัชภัณฑ์หรือเวชภัณฑ์ทางการแพทย์
อุตสาหกรรมผลิตภัณฑ์ยาง
อุตสาหกรรมผลิตภัณฑ์พลาสติก
อุตสาหกรรมผลิตภัณฑ์ที่ทำจากแร่อโลหะ
อุตสาหกรรมโลหะหรือผลิตภัณฑ์ที่ทำจากโลหะ
อุตสาหกรรมอุปกรณ์อิเล็กทรอนิกส์
อุตสาหกรรมเครื่องใช้ไฟฟ้าหรืออุปกรณ์ไฟฟ้า
อุตสาหกรรมเครื่องจักรหรือเครื่องมือกล
อุตสาหกรรมยานพาหนะ ชิ้นส่วนยานพาหนะ หรืออุปกรณ์เสริมสำหรับยานพาหนะ
อุตสาหกรรมเฟอร์นิเจอร์
อุตสาหกรรมเครื่องประดับ
อุตสาหกรรมเครื่องดนตรี
อุตสาหกรรมอุปกรณ์กีฬาออกกำลังกาย
อุตสาหกรรมของเล่น
อุตสาหกรรมเครื่องมืออุปกรณ์ทางการแพทย์
อุตสาหกรรมการผลิต การจัดส่ง หรือการจ่ายไฟฟ้า
อุตสาหกรรมการผลิตหรือการบรรจุก๊าซ
อุตสาหกรรมการผลิตถ่านโค้ก
อุตสาหกรรมการผลิต การเก็บ หรือการจำหน่ายไอน้ำ
อุตสาหกรรมการเลี้ยงสัตว์หรือการเพาะปลูก
สถานีบริการตามกฎหมายว่าด้วยการค้าน้ำมันเชื้อเพลิง
คลังน้ำมันเชื้อเพลิงตามกฎหมายว่าด้วยการควบคุมน้ำมันเชื้อเพลิง
การให้บริการบำบัดน้ำเสียหรือกำจัดของเสียตามกฎหมายว่าด้วยการส่งเสริมและรักษาคุณภาพสิ่งแวดล้อมแห่งชาติ
อุตสาหกรรมการนำวัสดุที่ใช้แล้วกลับมาใช้ใหม่
อุตสาหกรรมการแต่งแร่ การขุดแร่รายย่อย หรือการร่อนแร่ตามกฎหมายว่าด้วยแร่
การก่อสร้าง การดัดแปลง การซ่อมแซม หรือการรื้อถอนอาคารตามกฎหมายว่าด้วยการควบคุมอาคาร
อุตสาหกรรมการขนส่ง
การบริการการเดินอากาศตามกฎหมายว่าด้วยการเดินอากาศ
กิจการคลังสินค้า กิจการไซโล หรือกิจการห้องเย็นตามกฎหมายว่าด้วยคลังสินค้า ไซโล และห้องเย็น
กิจการโทรคมนาคมตามกฎหมายว่าด้วยองค์กรจัดสรรคลื่นความถี่และกำกับ การประกอบกิจการวิทยุกระจายเสียง วิทยุโทรทัศน์ และกิจการโทรคมนาคม
การติดตั้ง การซ่อม หรือการซ่อมบำรุงเครื่องจักร
โรงแรมตามกฎหมายว่าด้วยโรงแรม
กิจการนิติบุคคลอาคารชุดตามกฎหมายว่าด้วยอาคารชุด
ห้างสรรพสินค้า ธุรกิจค้าปลีก หรือธุรกิจค้าส่ง
ศูนย์การจัดประชุมและการแสดงสินค้า
โรงพยาบาล
การทดสอบและวิเคราะห์การปฏิบัติการทางกายภาพ เคมี ชีวภาพ หรือวิศวกรรม
การขายและการบำรุงรักษายานยนต์หรือการซ่อมยานยนต์
สวนสัตว์หรือสวนสนุก
*/
 const account2Options: TextValue[] = [
    {
        text: "อุตสาหกรรมสิ่งพิมพ์",
        value: "อุตสาหกรรมสิ่งพิมพ์"
    }
    ,
    {
        text: "อุตสาหกรรมผลิตภัณฑ์อาหาร",
        value: "อุตสาหกรรมผลิตภัณฑ์อาหาร"
    },
    {
        text: "อุตสาหกรรมเครื่องดื่ม",
        value: "อุตสาหกรรมเครื่องดื่ม"
    }
    ,
    {
        text: "อุตสาหกรรมผลิตภัณฑ์จากยาสูบ",
        value: "อุตสาหกรรมผลิตภัณฑ์จากยาสูบ"
    }
    ,
    {
        text: "อุตสาหกรรมสิ่งทอ",
        value: "อุตสาหกรรมสิ่งทอ"
    }
    ,
    {
        text: "อุตสาหกรรมเสื้อผ้าหรือเครื่องแต่งกาย",
        value: "อุตสาหกรรมเสื้อผ้าหรือเครื่องแต่งกาย"
    }
    ,
    {
        text: "อุตสาหกรรมเครื่องหนัง",
        value: "อุตสาหกรรมเครื่องหนัง"
    }
    ,
    {
        text: "อุตสาหกรรมผลิตภัณฑ์จากไม้",
        value: "อุตสาหกรรมผลิตภัณฑ์จากไม้"
    }
    ,
    {
        text: "อุตสาหกรรมกระดาษหรือผลิตภัณฑ์ที่แปรรูปจากกระดาษ",
        value: "อุตสาหกรรมกระดาษหรือผลิตภัณฑ์ที่แปรรูปจากกระดาษ"
    }
    ,
    {
        text: "อุตสาหกรรมการผลิตสารเคมีหรือเคมีภัณฑ์",
        value: "อุตสาหกรรมการผลิตสารเคมีหรือเคมีภัณฑ์"
    }
    ,
    {
        text: "อุตสาหกรรมเภสัชภัณฑ์หรือเวชภัณฑ์ทางการแพทย์",
        value: "อุตสาหกรรมเภสัชภัณฑ์หรือเวชภัณฑ์ทางการแพทย์"
    }
    ,
    {
        text: "อุตสาหกรรมผลิตภัณฑ์ยาง",
        value: "อุตสาหกรรมผลิตภัณฑ์ยาง"
    }
    ,
    {
        text: "อุตสาหกรรมผลิตภัณฑ์พลาสติก",
        value: "อุตสาหกรรมผลิตภัณฑ์พลาสติก"
    }
    ,
    {
        text: "อุตสาหกรรมผลิตภัณฑ์ที่ทำจากแร่อโลหะ",
        value: "อุตสาหกรรมผลิตภัณฑ์ที่ทำจากแร่อโลหะ"
    }
    ,
    {
        text: "อุตสาหกรรมโลหะหรือผลิตภัณฑ์ที่ทำจากโลหะ",
        value: "อุตสาหกรรมโลหะหรือผลิตภัณฑ์ที่ทำจากโลหะ"
    }
    ,
    {
        text: "อุตสาหกรรมอุปกรณ์อิเล็กทรอนิกส์",
        value: "อุตสาหกรรมอุปกรณ์อิเล็กทรอนิกส์"
    }
    ,
    {
        text: "อุตสาหกรรมเครื่องใช้ไฟฟ้าหรืออุปกรณ์ไฟฟ้า",
        value: "อุตสาหกรรมเครื่องใช้ไฟฟ้าหรืออุปกรณ์ไฟฟ้า"
    }
    ,
    {
        text: "อุตสาหกรรมเครื่องจักรหรือเครื่องมือกล",
        value: "อุตสาหกรรมเครื่องจักรหรือเครื่องมือกล"
    }
    ,
    {
        text: "อุตสาหกรรมยานพาหนะ ชิ้นส่วนยานพาหนะ หรืออุปกรณ์เสริมสำหรับยานพาหนะ",
        value: "อุตสาหกรรมยานพาหนะ ชิ้นส่วนยานพาหนะ หรืออุปกรณ์เสริมสำหรับยานพาหนะ"
    }
    ,
    {
        text: "อุตสาหกรรมเฟอร์นิเจอร์",
        value: "อุตสาหกรรมเฟอร์นิเจอร์"
    }
    ,
    {
        text: "อุตสาหกรรมเครื่องประดับ",
        value: "อุตสาหกรรมเครื่องประดับ"
    }
    ,
    {
        text: "อุตสาหกรรมเครื่องดนตรี",
        value: "อุตสาหกรรมเครื่องดนตรี"
    }
    ,
    {
        text: "อุตสาหกรรมอุปกรณ์กีฬาออกกำลังกาย",
        value: "อุตสาหกรรมอุปกรณ์กีฬาออกกำลังกาย"
    }
    ,
    {
        text: "อุตสาหกรรมของเล่น",
        value: "อุตสาหกรรมของเล่น"
    }
    ,
    {
        text: "อุตสาหกรรมเครื่องมืออุปกรณ์ทางการแพทย์",
        value: "อุตสาหกรรมเครื่องมืออุปกรณ์ทางการแพทย์"
    }
    ,
    {
        text: "อุตสาหกรรมการผลิต การจัดส่ง หรือการจ่ายไฟฟ้า",
        value: "อุตสาหกรรมการผลิต การจัดส่ง หรือการจ่ายไฟฟ้า"
    }
    ,
    {
        text: "อุตสาหกรรมการผลิตหรือการบรรจุก๊าซ",
        value: "อุตสาหกรรมการผลิตหรือการบรรจุก๊าซ"
    }
    ,
    {
        text: "อุตสาหกรรมการผลิตถ่านโค้ก",
        value: "อุตสาหกรรมการผลิตถ่านโค้ก"
    }
    ,
    {
        text: "อุตสาหกรรมการผลิต การเก็บ หรือการจำหน่ายไอน้ำ",
        value: "อุตสาหกรรมการผลิต การเก็บ หรือการจำหน่ายไอน้ำ"
    }
    ,
    {
        text: "อุตสาหกรรมการเลี้ยงสัตว์หรือการเพาะปลูก",
        value: "อุตสาหกรรมการเลี้ยงสัตว์หรือการเพาะปลูก"
    }
    ,
    {
        text: "สถานีบริการตามกฎหมายว่าด้วยการค้าน้ำมันเชื้อเพลิง",
        value: "สถานีบริการตามกฎหมายว่าด้วยการค้าน้ำมันเชื้อเพลิง"
    }
    ,
    {
        text: "คลังน้ำมันเชื้อเพลิงตามกฎหมายว่าด้วยการควบคุมน้ำมันเชื้อเพลิง",
        value: "คลังน้ำมันเชื้อเพลิงตามกฎหมายว่าด้วยการควบคุมน้ำมันเชื้อเพลิง"
    }
    ,
    {
        text: "การให้บริการบำบัดน้ำเสียหรือกำจัดของเสียตามกฎหมายว่าด้วยการส่งเสริมและรักษาคุณภาพสิ่งแวดล้อมแห่งชาติ",
        value: "การให้บริการบำบัดน้ำเสียหรือกำจัดของเสียตามกฎหมายว่าด้วยการส่งเสริมและรักษาคุณภาพสิ่งแวดล้อมแห่งชาติ"
    }
    ,
    {
        text: "อุตสาหกรรมการนำวัสดุที่ใช้แล้วกลับมาใช้ใหม่",
        value: "อุตสาหกรรมการนำวัสดุที่ใช้แล้วกลับมาใช้ใหม่"
    }
    ,
    {
        text: "อุตสาหกรรมการแต่งแร่ การขุดแร่รายย่อย หรือการร่อนแร่ตามกฎหมายว่าด้วยแร่",
        value: "อุตสาหกรรมการแต่งแร่ การขุดแร่รายย่อย หรือการร่อนแร่ตามกฎหมายว่าด้วยแร่"
    }
    ,
    {
        text: "การก่อสร้าง การดัดแปลง การซ่อมแซม หรือการรื้อถอนอาคารตามกฎหมายว่าด้วยการควบคุมอาคาร",
        value: "การก่อสร้าง การดัดแปลง การซ่อมแซม หรือการรื้อถอนอาคารตามกฎหมายว่าด้วยการควบคุมอาคาร"
    }
    ,
    {
        text: "อุตสาหกรรมการขนส่ง",
        value: "อุตสาหกรรมการขนส่ง"
    }
    ,
    {
        text: "การบริการการเดินอากาศตามกฎหมายว่าด้วยการเดินอากาศ",
        value: "การบริการการเดินอากาศตามกฎหมายว่าด้วยการเดินอากาศ"
    }
    ,
    {
        text: "กิจการคลังสินค้า กิจการไซโล หรือกิจการห้องเย็นตามกฎหมายว่าด้วยคลังสินค้า ไซโล และห้องเย็น",
        value: "กิจการคลังสินค้า กิจการไซโล หรือกิจการห้องเย็นตามกฎหมายว่าด้วยคลังสินค้า ไซโล และห้องเย็น"
    }
    ,
    {
        text: "กิจการโทรคมนาคมตามกฎหมายว่าด้วยองค์กรจัดสรรคลื่นความถี่และกำกับ การประกอบกิจการวิทยุกระจายเสียง วิทยุโทรทัศน์ และกิจการโทรคมนาคม",
        value: "กิจการโทรคมนาคมตามกฎหมายว่าด้วยองค์กรจัดสรรคลื่นความถี่และกำกับ การประกอบกิจการวิทยุกระจายเสียง วิทยุโทรทัศน์ และกิจการโทรคมนาคม"
    }
    ,
    {
        text: "การติดตั้ง การซ่อม หรือการซ่อมบำรุงเครื่องจักร",
        value: "การติดตั้ง การซ่อม หรือการซ่อมบำรุงเครื่องจักร"
    }
    ,
    {
        text: "โรงแรมตามกฎหมายว่าด้วยโรงแรม",
        value: "โรงแรมตามกฎหมายว่าด้วยโรงแรม"
    }
    ,
    {
        text: "กิจการนิติบุคคลอาคารชุดตามกฎหมายว่าด้วยอาคารชุด",
        value: "กิจการนิติบุคคลอาคารชุดตามกฎหมายว่าด้วยอาคารชุด"
    }
    ,
    {
        text: "ห้างสรรพสินค้า ธุรกิจค้าปลีก หรือธุรกิจค้าส่ง",
        value: "ห้างสรรพสินค้า ธุรกิจค้าปลีก หรือธุรกิจค้าส่ง"
    }
    ,
    {
        text: "ศูนย์การจัดประชุมและการแสดงสินค้า",
        value: "ศูนย์การจัดประชุมและการแสดงสินค้า"
    }
    ,
    {
        text: "โรงพยาบาล",
        value: "โรงพยาบาล"
    }
    ,
    {
        text: "การทดสอบและวิเคราะห์การปฏิบัติการทางกายภาพ เคมี ชีวภาพ หรือวิศวกรรม",
        value: "การทดสอบและวิเคราะห์การปฏิบัติการทางกายภาพ เคมี ชีวภาพ หรือวิศวกรรม"
    }
    ,
    {
        text: "การขายและการบำรุงรักษายานยนต์หรือการซ่อมยานยนต์",
        value: "การขายและการบำรุงรักษายานยนต์หรือการซ่อมยานยนต์"
    }
    ,
    {
        text: "สวนสัตว์หรือสวนสนุก",
        value: "สวนสัตว์หรือสวนสนุก"
    }

]

/*
ธุรกิจสถาบันการเงินตามกฎหมายว่าด้วยธุรกิจสถาบันการเงิน
ธุรกิจหลักทรัพย์ตามกฎหมายว่าด้วยหลักทรัพย์และตลาดหลักทรัพย์
สหกรณ์ตามกฎหมายว่าด้วยสหกรณ์
การประกันชีวิตตามกฎหมายว่าด้วยการประกันชีวิตหรือการประกันวินาศภัย ตามกฎหมายว่าด้วยการประกันวินาศภัย
โรงรับจำนำตามกฎหมายว่าด้วยโรงรับจำนำ
โรงถ่ายทำภาพยนตร์หรือละคร
สวนพฤกษศาสตร์
สนามกีฬาหรือการนันทนาการ
สถานที่มีอาหาร สุรา หรือเครื่องดื่มอย่างอื่นจำหน่าย โดยจัดให้มีการแสดงดนตรี หรือการแสดงอื่นใดเพื่อการบันเทิง
สำนักงานบริหารของสถานประกอบกิจการตามบัญชี 1 และบัญชี 2
*/
 const account3Options: TextValue[] = [
    {
        text: "ธุรกิจสถาบันการเงินตามกฎหมายว่าด้วยธุรกิจสถาบันการเงิน",
        value: "ธุรกิจสถาบันการเงินตามกฎหมายว่าด้วยธุรกิจสถาบันการเงิน"
    }
    ,
    {
        text: "ธุรกิจหลักทรัพย์ตามกฎหมายว่าด้วยหลักทรัพย์และตลาดหลักทรัพย์",
        value: "ธุรกิจหลักทรัพย์ตามกฎหมายว่าด้วยหลักทรัพย์และตลาดหลักทรัพย์"
    }
    ,
    {
        text: "สหกรณ์ตามกฎหมายว่าด้วยสหกรณ์",
        value: "สหกรณ์ตามกฎหมายว่าด้วยสหกรณ์"
    }
    ,
    {
        text: "การประกันชีวิตตามกฎหมายว่าด้วยการประกันชีวิตหรือการประกันวินาศภัย ตามกฎหมายว่าด้วยการประกันวินาศภัย",
        value: "การประกันชีวิตตามกฎหมายว่าด้วยการประกันชีวิตหรือการประกันวินาศภัย ตามกฎหมายว่าด้วยการประกันวินาศภัย"
    }
    ,
    {
        text: "โรงรับจำนำตามกฎหมายว่าด้วยโรงรับจำนำ",
        value: "โรงรับจำนำตามกฎหมายว่าด้วยโรงรับจำนำ"
    }
    ,
    {
        text: "โรงถ่ายทำภาพยนตร์หรือละคร",
        value: "โรงถ่ายทำภาพยนตร์หรือละคร"
    }
    ,
    {
        text: "สวนพฤกษศาสตร์",
        value: "สวนพฤกษศาสตร์"
    }
    ,
    {
        text: "สนามกีฬาหรือการนันทนาการ",
        value: "สนามกีฬาหรือการนันทนาการ"
    }
    ,
    {
        text: "สถานที่มีอาหาร สุรา หรือเครื่องดื่มอย่างอื่นจำหน่าย โดยจัดให้มีการแสดงดนตรี หรือการแสดงอื่นใดเพื่อการบันเทิง",
        value: "สถานที่มีอาหาร สุรา หรือเครื่องดื่มอย่างอื่นจำหน่าย โดยจัดให้มีการแสดงดนตรี หรือการแสดงอื่นใดเพื่อการบันเทิง"
    }
    ,
    {
        text: "สำนักงานบริหารของสถานประกอบกิจการตามบัญชี 1 และบัญชี 2",
        value: "สำนักงานบริหารของสถานประกอบกิจการตามบัญชี 1 และบัญชี 2"
    }
]

export const accountOptions: { text: string, options: TextValue[] }[] = [
    {
        text: "1",
        options: account1Options
    },
    {
        text: "2",
        options: account2Options
    },
    {
        text: "3",
        options: account3Options
    }
]

/*
ไม่เข้าข่ายโรงงานอุตสาหกรรม
โรงงานจำพวก 1
โรงงานจำพวก 2
โรงงานจำพวก 3
โรงงานจำพวก 4
*/

export const factoryBusinessTypeOptions: TextValue[] = [
    {
        text: "ไม่เข้าข่ายโรงงานอุตสาหกรรม",
        value: "ไม่เข้าข่ายโรงงานอุตสาหกรรม"
    },
    {
        text: "โรงงานจำพวก 1",
        value: "โรงงานจำพวก 1"
    },
    {
        text: "โรงงานจำพวก 2",
        value: "โรงงานจำพวก 2"
    },
    {
        text: "โรงงานจำพวก 3",
        value: "โรงงานจำพวก 3"
    },
    {
        text: "โรงงานจำพวก 4",
        value: "โรงงานจำพวก 4"
    }
]


/*
ไม่มีการครอบครองเครื่องจักร
ไม่เกิน 20 แรงม้า  
ไม่เกิน 50 แรงม้า
มากกว่าหรือเท่ากับ 50 แรงม้า 
*/

export const possessionOfMachnePowerOptions: TextValue[] = [
    {
        text: "ไม่มีการครอบครองเครื่องจักร",
        value: "ไม่มีการครอบครองเครื่องจักร"
    },
    {
        text: "ไม่เกิน 20 แรงม้า",
        value: "ไม่เกิน 20 แรงม้า"
    },
    {
        text: "ไม่เกิน 50 แรงม้า",
        value: "ไม่เกิน 50 แรงม้า"
    },
    {
        text: "มากกว่าหรือเท่ากับ 50 แรงม้า",
        value: "มากกว่าหรือเท่ากับ 50 แรงม้า"
    }
]

/* 
ไม่เข้าข่าย
อาคาคสูง 23 ม.ขึ้นไป,
อาคารใหญ่พิเศษมี พท.รวมตั้งแต่ 10,000 ตร.ม.ขึ้นไป 
อาคารขนาดใหญ่มีพท.รวมเกิน 2,000 ตร.ม.ขึ้นไป หรือสูง 15 ม. และพท.รวมเกิน 1,000 ตร.ม. แต่ไม่เกิน 2,000 ตร.ม.
อาคารสาธารณะ
 อาคารอาศัยรวม
 สำนักงานมีพท.รวมเกิน 300 ตร.ม.ขึ้นไป 
ไม่เข้าข่าย
*/

export const buildingAreaSizeOptions: TextValue[] = [
    {
        text: "ไม่เข้าข่าย",
        value: "ไม่เข้าข่าย"
    },
    {
        text: "อาคาคสูง 23 ม.ขึ้นไป",
        value: "อาคาคสูง 23 ม.ขึ้นไป"
    },
    {
        text: "อาคารใหญ่พิเศษมี พท.รวมตั้งแต่ 10,000 ตร.ม.ขึ้นไป",
        value: "อาคารใหญ่พิเศษมี พท.รวมตั้งแต่ 10,000 ตร.ม.ขึ้นไป"
    },
    {
        text: "อาคารขนาดใหญ่มีพท.รวมเกิน 2,000 ตร.ม.ขึ้นไป หรือสูง 15 ม. และพท.รวมเกิน 1,000 ตร.ม. แต่ไม่เกิน 2,000 ตร.ม.",
        value: "อาคารขนาดใหญ่มีพท.รวมเกิน 2,000 ตร.ม.ขึ้นไป หรือสูง 15 ม. และพท.รวมเกิน 1,000 ตร.ม. แต่ไม่เกิน 2,000 ตร.ม."
    },
    {
        text: "อาคารสาธารณะ",
        value: "อาคารสาธารณะ"
    },
    {
        text: "อาคารอาศัยรวม",
        value: "อาคารอาศัยรวม"
    },
    {
        text: "สำนักงานมีพท.รวมเกิน 300 ตร.ม.ขึ้นไป",
        value: "สำนักงานมีพท.รวมเกิน 300 ตร.ม.ขึ้นไป"
    },
]


/**
 อาคารสาธารณะ
อาคารอาศัยรวม
สำนักงานมีพท.รวมเกิน 300 ตร.ม.ขึ้นไป 
ไม่เข้าข่าย
 */
export const buildingTypeOptions: TextValue[] = [
    {
        text: "อาคารสาธารณะ",
        value: "อาคารสาธารณะ"
    },
    {
        text: "อาคารอาศัยรวม",
        value: "อาคารอาศัยรวม"
    },
    {
        text: "สำนักงานมีพท.รวมเกิน 300 ตร.ม.ขึ้นไป",
        value: "สำนักงานมีพท.รวมเกิน 300 ตร.ม.ขึ้นไป"
    },
    {
        text: "ไม่เข้าข่าย",
        value: "ไม่เข้าข่าย"
    }
]


/*
น้อยกว่า 1,175KVA 
1,175-3,530KVA  
มากกว่า 3,530 KVA 
ไม่มีหม้อแปลง
*/
export const transformerSizeOptions: TextValue[] = [
    {
        text: "น้อยกว่า 1,175 KVA",
        value: "น้อยกว่า 1,175 KVA"
    },
    {
        text: "1,175-3,530 KVA",
        value: "1,175-3,530 KVA"
    },
    {
        text: "มากกว่า 3,530 KVA",
        value: "มากกว่า 3,530 KVA"
    },
    {
        text: "ไม่มีหม้อแปลง",
        value: "ไม่มีหม้อแปลง"
    },
]


/**
น้อยกว่า 1,000 kW 
1,000-3,000 kW 
มากกว่า 3,000 kW
ไม่มีเครื่องวัดไฟฟ้า
*/


export const electricMeterSize = [
    {
        text: "น้อยกว่า 1,000 kW",
        value: "น้อยกว่า 1,000 kW"
    },
    {
        text: "1,000-3,000 kW",
        value: "1,000-3,000 kW"
    },
    {
        text: "มากกว่า 3,000 kW",
        value: "มากกว่า 3,000 kW"
    },
    {
        text: "ไม่มีเครื่องวัดไฟฟ้า",
        value: "ไม่มีเครื่องวัดไฟฟ้า"
    },
]

/**
น้อยกว่า20 ล้าน mj/ปี
 20-60 ล้าน mj/ปี
 มากกว่า 60ล้าน mj/ปี 
*/

export const electricityConsumptionOptions = [
    {
        text: "น้อยกว่า 20 ล้าน mj/ปี",
        value: "น้อยกว่า 20 ล้าน mj/ปี"
    },
    {
        text: "20-60 ล้าน mj/ปี",
        value: "20-60 ล้าน mj/ปี"
    },
    {
        text: "มากกว่า 60 ล้าน mj/ปี",
        value: "มากกว่า 60 ล้าน mj/ปี"
    },
]

/**
ยื่นขออนุญาตหรือได้รับอนุญาตก่อสร้าง ดัดแปลง หรือเปลี่ยนแปลงก่อนวันที่ 17 ก.พ. 2535, 
ยื่นขออนุญาตหรือได้รับอนุญาตก่อสร้าง ดัดแปลง หรือเปลี่ยนแปลงหลังวันที่ 17 ก.พ. 2535 แต่ก่อนวันที่ 11 พ.ย. 2540
ยื่นขออนุญาตหรือได้รับอนุญาตก่อสร้าง ดัดแปลง หรือเปลี่ยนแปลงหลังวันที่ 11 พ.ย. 2540 แต่ก่อนวันที่ 1 ธ.ค. 2564
ยื่นขออนุญาตหรือได้รับอนุญาตก่อสร้าง ดัดแปลง หรือเปลี่ยนแปลงหลังวันที่ 1 ธ.ค. 2564 )
*/

export const dateOfConstructionOptions = [
    {
        text: "ยื่นขออนุญาตหรือได้รับอนุญาตก่อสร้าง ดัดแปลง หรือเปลี่ยนแปลงก่อนวันที่ 17 ก.พ. 2535",
        value: "0001-01-01T00:00:00+07:00|1992-02-16T23:59:59+07:00"
    },
    {
        text: "ยื่นขออนุญาตหรือได้รับอนุญาตก่อสร้าง ดัดแปลง หรือเปลี่ยนแปลงหลังวันที่ 17 ก.พ. 2535 แต่ก่อนวันที่ 11 พ.ย. 2540",
        value: "1992-02-17T00:00:00+07:00|2007-11-10T23:59:59+07:00"
    },
    {
        text: "ยื่นขออนุญาตหรือได้รับอนุญาตก่อสร้าง ดัดแปลง หรือเปลี่ยนแปลงหลังวันที่ 11 พ.ย. 2540 แต่ก่อนวันที่ 1 ธ.ค. 2564",
        value: "2007-11-11T00:00:00+07:00|2021-11-31T23:59:59+07:00"
    },
    {
        text: "ยื่นขออนุญาตหรือได้รับอนุญาตก่อสร้าง ดัดแปลง หรือเปลี่ยนแปลงหลังวันที่ 1 ธ.ค. 2564",
        value: "2021-12-01T00:00:00+07:00|9999-12-31T23:59:59+07:00"
    },
]