import { Button } from "@/app/ui/button/button";
import Modal from "@/app/ui/modal/modal";
import React from "react";

type ModalConfirmSaveNewLicenseProps = {
  manageModalState: [boolean, React.Dispatch<React.SetStateAction<boolean>>];
  onConfirm: () => void;
};

function ModalConfirmSaveNewLicense({
  manageModalState,
  onConfirm,
}: ModalConfirmSaveNewLicenseProps) {
  const [open, setOpenModal] = manageModalState;
  return (
    <Modal open={open} width="20%">
      <div className="p-4 flex flex-col items-center justify-center gap-4">
        <div className="pt-4">
          <svg
            width="73"
            height="88"
            viewBox="0 0 73 88"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M69.0051 70.9811C67.8887 70.6901 66.7519 71.3597 66.4618 72.4742C64.7847 78.9235 58.9 83.4281 52.1528 83.4281C46.9718 83.4281 42.3192 80.7573 39.6708 76.6031L41.0529 77.0635C41.2719 77.1365 41.4948 77.1715 41.7129 77.1715C42.5869 77.1715 43.4006 76.6187 43.6916 75.7446C44.0566 74.6516 43.4658 73.4709 42.3728 73.1059L37.0214 71.3218C36.6252 71.0395 36.1464 70.9159 35.6412 70.9607C34.698 70.876 33.7889 71.4035 33.4775 72.3379L31.3916 78.5955C31.0266 79.6886 31.6174 80.8692 32.7105 81.2342C32.9295 81.3072 33.1524 81.3423 33.3704 81.3423C34.2445 81.3423 35.0582 80.7894 35.3492 79.9153L35.8583 78.3872C39.2017 83.9839 45.3288 87.5998 52.1538 87.5998C60.7999 87.5998 68.3442 81.8124 70.4992 73.5254C70.7892 72.41 70.1206 71.2712 69.0051 70.9811Z"
              fill="#10684A"
            />
            <path
              d="M71.5738 56.4213C70.4759 56.0533 69.2991 56.649 68.9351 57.7401L68.4338 59.2439C65.0875 53.6619 58.9691 50.0566 52.1538 50.0566C43.5087 50.0566 35.9653 55.8441 33.8094 64.131C33.5194 65.2465 34.188 66.3843 35.3025 66.6753C36.4209 66.9634 37.5548 66.2948 37.8468 65.1822C39.5238 58.7329 45.4076 54.2283 52.1548 54.2283C57.3397 54.2283 61.9952 56.9031 64.6427 61.0631L63.2313 60.593C62.1344 60.227 60.9567 60.8198 60.5926 61.9118C60.2276 63.0049 60.8184 64.1855 61.9115 64.5505L67.2347 66.3249C67.5899 66.5897 68.024 66.7435 68.4805 66.7435C68.5438 66.7435 68.609 66.725 68.6723 66.7191C68.7239 66.723 68.7774 66.7444 68.828 66.7444C69.702 66.7444 70.5158 66.1916 70.8068 65.3175L72.8926 59.06C73.2567 57.9669 72.6659 56.7863 71.5738 56.4213Z"
              fill="#10684A"
            />
            <path
              d="M43.7999 27.1143H10.4282V31.286H43.7999V27.1143Z"
              fill="#06120E"
            />
            <path
              d="M31.2858 18.7715H10.4282V22.9432H31.2858V18.7715Z"
              fill="#06120E"
            />
            <path
              d="M43.7999 35.458H10.4282V39.6297H43.7999V35.458Z"
              fill="#06120E"
            />
            <path
              d="M37.5424 43.7998H10.4282V47.9715H37.5424V43.7998Z"
              fill="#06120E"
            />
            <path
              d="M29.1999 52.1426H10.4282V56.3143H29.1999V52.1426Z"
              fill="#06120E"
            />
            <path
              d="M4.17073 64.6576V6.25756C4.17073 5.10805 5.10708 4.17171 6.25659 4.17171H33.3707C35.0468 4.17171 37.5424 5.28325 37.5424 8.34341V14.6C37.5424 15.7515 38.4759 16.6859 39.6283 16.6859H45.8859C48.8886 16.6859 50.0576 17.8548 50.0576 20.8576V45.8859H54.2293V20.8576C54.2293 15.5558 51.1886 12.5151 45.8868 12.5151H41.7151V8.34341C41.7142 3.04069 38.6725 0 33.3707 0H6.25659C2.80612 0 0 2.80709 0 6.25756V64.6576C0 68.108 2.80709 70.9151 6.25756 70.9151H29.2V66.7434H6.25659C5.10708 66.7425 4.17073 65.8071 4.17073 64.6576Z"
              fill="#06120E"
            />
          </svg>
        </div>
        <div className="flex flex-col gap-2 items-center">
          <span>คุณต้องการบันทึกรายการ</span>
          <span>ใบนุญาตนี้หรือไม่</span>
        </div>
        <div className="flex gap-2  w-full">
          <Button
            variant="primary"
            className="bg-[#F6F6F6] grow text-darkgreen border-0
            hover:bg-[#E5E5E5] hover:text-darkgreen
            "
            type="button"
            onClick={() => setOpenModal(false)}
          >
            ไม่ใช่
          </Button>
          <Button
            variant="primary"
            className="grow"
            onClick={() => {
              setOpenModal(false);
              onConfirm();
            }}
          >
            ใช่ ต้องการ
          </Button>
        </div>
      </div>
    </Modal>
  );
}

export default ModalConfirmSaveNewLicense;
